html/1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-27 Tue 09:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>自定义Emacs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shuai Zhao" />
<link rel="stylesheet" type="text/css" href="../resource/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">自定义Emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org622704f">1. 在本章：</a></li>
<li><a href="#org9e5f26e">2. Backspace 和 Delete</a></li>
<li><a href="#orgeac2fc0">3. Lisp</a></li>
<li><a href="#orgc898d45">4. 按键和字符串</a>
<ul>
<li><a href="#org27671de">4.1. META键</a></li>
<li><a href="#orgd85d6c3">4.2. 将按键绑定到命令上</a></li>
<li><a href="#orgab78ad7">4.3. 字符串表示按键</a></li>
</ul>
</li>
<li><a href="#org02f463b">5. C-h绑定到什么</a></li>
<li><a href="#orgbb0f5ee">6. C-h应该绑定到什么？</a></li>
<li><a href="#org86bff57">7. 执行Lisp表达式</a></li>
<li><a href="#orga9cf37d">8. Apropos</a></li>
</ul>
</div>
</div>

<div id="outline-container-org622704f" class="outline-2">
<h2 id="org622704f"><span class="section-number-2">1</span> 在本章：</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Backspace和Delete</b><br />
<b>Lisp</b><br />
<b>按键和字符串</b><br />
<b>C-h绑定到什么</b><br />
<b>C-h应该绑定到什么</b><br />
<b>执行Lisp表达式</b><br />
<b>Apropos</b><br />
</p>

<p>
本章将介绍基本的Emacs定制化，并且在这一过程中教给你一些Emacs Lisp。最简单、最常见的定制之一就是将一个按键的命令复制到另一个按键上。可能你不喜欢Emacs的两次按键（C-x C-s）来保存文件，因为其他的编辑器通常都只是简单的C-s。或者你可能只是想按C-x，却不小心按成C-x C-c，也就是退出Emacs，而你希望按下C-x C-c不要造成这么酷炫的效果。或者也可能，就像下面的例子所展示的，你可能希望对Emacs提供给你的键位做出一些自己的修改。<br />
</p>
</div>
</div>

<div id="outline-container-org9e5f26e" class="outline-2">
<h2 id="org9e5f26e"><span class="section-number-2">2</span> Backspace 和 Delete</h2>
<div class="outline-text-2" id="text-2">
<p>
想象你想要输入“Lisp”但却输成了“List”。要改正你的拼写，你是按下BACKSPACE键呢还是DELETE键？<br />
</p>

<p>
这当然由你的键盘而定，但是我要问的并不仅仅是一个按键上标记了什么的问题。有时按键上标记的是“Backspace”，有时它又被标记为“Delete”，有时又是“Erase”，有时是一个向左的箭头或是别的什么图案。对于Emacs来说，按键上标记着什么并不重要，它在乎的是按下这个键时所触发的数字代码。“向左移动并且删掉前面的字符”可能会产生一个ASCII的“backspace”编码（十进制8，通常表示为BS）或者一个ASCII的“delete”编码（十进制127，通常表示为DEL）。<br />
</p>

<p>
在Emacs的默认配置中，认为只有DEL表示“向左移动并且删掉前面的字符”。如果你的BACKSPACE/DELETE/ERASE键产生了一个BS，那么它将不会按照你所希望的那样执行。<br />
</p>

<p>
更糟的是当你按下BACKSPACE/DELETE/ERASE键，它却产生了一个BS时。Emacs认为既然BS并不用来左移并删除前面的字符，那么它就可以用来触发另一个方法。结果是，BS现在触发的方法和按下C-h时触发的一样。如果你们那里并不需要C-h来执行左移并删除前面的字符，那么C-h更好的选择是作为一个Help键，而这也是Emacs的选择。不幸的是，这意味着如果你的BACKSPACE/DELETE/ERASE触发BS的话，那么按下它将不会触发backspace,delete或者erase；它将触发Emacs的在线帮助。<br />
</p>

<p>
当Emacs的初学者想要修正一个拼写错误时，他们不止一次的被Emacs做出了热烈的欢迎。突然一个新的Emacs窗口&#x2013;帮助窗口&#x2013;弹了出来，提示不幸的用户来选择一些帮助命令。帮助的内容如此的冗长使得用户更加的瞠目结舌。用户恐慌的按下一大堆的C-g（终止当前的操作），伴随着一大堆的终端错误铃声提示。怪不得许多聪明善良的用户选择继续使用安全无害的vi，而不是成为Emacs的疯狂传道者。我每当想起这件事就很伤心，特别是这一情形很容易被修复。Emacs启动时，它将读取并且执行你的根目录下的.emacs文件。它使用Emacs Lisp作为语言，而读完本书你会发现，只要编写一些Emacs Lisp放到.emacs里，Emacs几乎没有什么是你不能改变的。我们要关注的第一件事就是向.emacs中添加一些代码来把BS和DEL都指定为“向前退格并且删掉一个字符”，而将帮助命令移动到其他键上去。首先我们需要看一下.emacs文件所使用的语言，Lisp。<br />
</p>
</div>
</div>

<div id="outline-container-orgeac2fc0" class="outline-2">
<h2 id="orgeac2fc0"><span class="section-number-2">3</span> Lisp</h2>
<div class="outline-text-2" id="text-3">
<p>
自从1950年以来已经产生了很多种不同形式的Lisp。最初它应用于人工智能，它很胜任这份工作，因为它允许符号运算，可以将代码作为数据处理，可以简化复杂数据结构的构建。但是Lisp可以做的要比一门AI语言多得多。它应用于非常广的问题处理上，这经常被计算机科学家忽视，而Emacs用户却知道的很清楚。Lisp不同于其他编程语言的特性有：<br />
</p>
<ul class="org-ul">
<li><p>
括号前缀表示法<br />
Lisp中的所有表达式和方法都由括号括起来[<a href="#org3d41fe9">1</a>]，方法名通常在参数之前。所以在其他语言中你通常会这么写：<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp">x + y
</pre>
</div>

<p>
而在Lisp中，你会这么写：<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #AE81FF;">(</span>+ x y<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
“前缀表示法”表示运算符在运算对象的前面。当运算符在运算对象中间时，这称为“中缀表示法”。<br />
</p>

<p>
虽然与通常的习惯不同，但前缀表示法相对于中缀有一些好处。在中缀语言中，要将5个变量加起来需要4个加号：<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp">a + b + c + d + e
</pre>
</div>

<p>
Lisp更简洁：<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #AE81FF;">(</span>+ a b c d e<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
而且，不会产生运算符的优先级问题。例如，<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">3 + 4 * 5
</pre>
</div>
<p>
的结果是35还是23？这需要知道*是否比+具有更高的优先级。而在Lisp中，就不会有这种疑惑：<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #AE81FF;">(</span>+ 3 <span style="color: #66D9EF;">(</span>* 4 5<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> <span style="color: #75715E;">; </span><span style="color: #75715E;">&#32467;&#26524;&#26159;23</span>
<span style="color: #AE81FF;">(</span>* <span style="color: #66D9EF;">(</span>+ 3 4<span style="color: #66D9EF;">)</span> 5<span style="color: #AE81FF;">)</span> <span style="color: #75715E;">; </span><span style="color: #75715E;">&#32467;&#26524;&#26159;35</span>
</pre>
</div>
<p>
（Lisp中的注释使用分号，作用到行尾。）最后，中缀语言需要在方法中使用逗号分隔参数：<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp">foo<span style="color: #AE81FF;">(</span>3 + 4, 5 + 6<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
Lisp不需要额外的语法：<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #AE81FF;">(</span>foo <span style="color: #66D9EF;">(</span>+ 3 4<span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">(</span>+ 5 6<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div></li>

<li><p>
List数据类型<br />
Lisp有一种内建的数据类型称为列表（list）。列表是一种用括号括起来的，不包含或者包含着其他Lisp对象的Lisp对象。下面是一些列表：<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #AE81FF;">(</span>hello there<span style="color: #AE81FF;">)</span> <span style="color: #75715E;">;</span><span style="color: #75715E;">&#21253;&#21547;&#30528;&#20004;&#20010;&#8220;&#31526;&#21495;&#8221;&#30340;&#21015;&#34920;</span>
<span style="color: #AE81FF;">(</span>1 2 <span style="color: #E6DB74;">"xyz"</span><span style="color: #AE81FF;">)</span> <span style="color: #75715E;">;</span><span style="color: #75715E;">&#20004;&#20010;&#25968;&#23383;&#21644;&#19968;&#20010;&#23383;&#31526;&#20018;</span>
<span style="color: #AE81FF;">()</span> <span style="color: #75715E;">;</span><span style="color: #75715E;">&#31354;&#21015;&#34920;</span>
</pre>
</div>

<p>
列表可以作为值赋给其他变量，作为参数传递给方法以及作为返回值传递，使用cons和append这种方法来进行组合，使用car和cdr来进行拆分。后面我们将会更详细地叙述这些知识。<br />
</p></li>

<li><p>
垃圾回收<br />
Lisp是一种垃圾回收的语言，这意味着Lisp会自动的回收你的程序里的数据结构所使用的内存。与之相反的，比如C语言，程序员必须显式的使用malloc来分配内存，然后显式的使用free来释放内存。（在非垃圾回收语言里，malloc/free这种语句非常容易出错。过早的释放内存是全世界程序错误中最大的原因之一，而忘记释放内存则会造成内存的泄露。）<br />
</p>

<p>
除了所有这些垃圾回收机制所具有的有点，它也有一个缺点：Emacs会不时的停下正在做的所有事情，向用户显示“Garbage collecting&#x2026;”。用户要等到垃圾回收结束才能继续使用Emacs[<a href="#orgd62b147">2</a>]。这通常只会持续不到1s，但是却可能非常频繁。后面我们将会学到如何减少垃圾回收发生的实用技巧。<br />
</p></li>
</ul>

<p>
表达式（expression）通常表示Lisp代码中的任何一部分或者任何Lisp数据结构。所有Lisp表达式，不管是代码还是数据，都可以被Emacs中内建的Lisp解释器执行。对一个变量求值的结果就是访问之前储存在变量中的Lisp对象。就像我们下面将要看到的，用来执行Lisp函数的方式就是对一个列表求值。<br />
</p>

<p>
自从Lisp发明以来已经产生了许多Lisp方言，它们之间各有不同。MacLisp, Scheme和Common Lisp是其中较为有名的。Emacs Lisp和它们都不一样。这本书只关注Emacs Lisp。<br />
</p>
</div>
</div>

<div id="outline-container-orgc898d45" class="outline-2">
<h2 id="orgc898d45"><span class="section-number-2">4</span> 按键和字符串</h2>
<div class="outline-text-2" id="text-4">
<p>
本章的目的是使所有触发BS的键同触发DEL的键能一样的工作。当然这将导致C-h不再触发帮助命令。你需要选择其他的键来使用帮助；我自己的方式是使用META-question-mark。<br />
</p>
</div>
<div id="outline-container-org27671de" class="outline-3">
<h3 id="org27671de"><span class="section-number-3">4.1</span> META键</h3>
<div class="outline-text-3" id="text-4-1">
<p>
META键的工作方式和CONTROL键以及SHIFT键一样，都是需要在按下其他键的同时按着它。这种键被称为修饰键（modifiers）。虽然不是所有键盘都有META键。有时ALT键起着同样的作用，但是也不是所有键盘都有ALT键。无论如何，你都不是必须使用META或者ALT。单次按键META-x总是可以使用两键序列ESC x来替代。（注意ESC不是修饰键&#x2013;你需要先按下ESC，松开手，再按下x键。）<br />
</p>
</div>
</div>

<div id="outline-container-orgd85d6c3" class="outline-3">
<h3 id="orgd85d6c3"><span class="section-number-3">4.2</span> 将按键绑定到命令上</h3>
<div class="outline-text-3" id="text-4-2">
<p>
在Emacs里，每个按键都触发一条命令或者是一个触发命令的多键序列的一部分。就像我们将要看到的，命令是一种特殊的Lisp函数。使一个按键触发类似帮助这种命令的行为被称为绑定。我们需要执行一些Lisp代码来将按键绑定到命令上。global-set-key是一个用于做这件事的函数。<br />
</p>

<p>
下面介绍如何调用global-set-key。记住在Lisp里函数调用就是简单的一个括起来的列表。第一个元素是函数名称，剩下的元素全是参数。函数global-set-key使用两个参数：要绑定的按键序列，以及要绑定的命令。<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #AE81FF;">(</span>global-set-key keysequence command<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
需要注意Emacs Lisp是区分大小写的。<br />
</p>

<p>
我们选择的按键序列是META-question-mark。这在Emacs Lisp中如何表示呢？<br />
</p>
</div>
</div>

<div id="outline-container-orgab78ad7" class="outline-3">
<h3 id="orgab78ad7"><span class="section-number-3">4.3</span> 字符串表示按键</h3>
<div class="outline-text-3" id="text-4-3">
<p>
在Emacs Lisp中有一些不同的方式来表示一个按键序列。最简单的是直接使用字符串。在Lisp中，字符串是一些被引号括起来的字符序列。<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #E6DB74;">"xyz"</span> <span style="color: #75715E;">; </span><span style="color: #75715E;">&#19977;&#20010;&#23383;&#27597;&#30340;&#23383;&#31526;&#20018;</span>
</pre>
</div>

<p>
要在字符串中使用双引号，使用反斜杠（\）：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #E6DB74;">"I said, \"Look out!\""</span>
</pre>
</div>

<p>
这表示如下字符串：<br />
</p>
<div class="org-src-container">
<pre class="src src-text">I said, "Look out!"
</pre>
</div>

<p>
要在字符串中表示反斜杠需要使用另一个反斜杠对其转义。<br />
</p>

<p>
普通的按键使用它所代表的字符来表示它。例如，按键q在Lisp中被字符串“q”所表示。而反斜杠\则写作“\\”。<br />
</p>

<p>
像META-question-mark这种特殊字符在字符串里使用特殊的标识符：“\M-?”来表示。虽然字符串里有四个字母，但Emacs会将此字符串读为META question-mark[<a href="#orgceb1693">3</a>]。<br />
</p>

<p>
在Emacs的术语中，M-x是META-x的简写，“\M-x”是字符串版本。CONTROL-x在Emacs文档中简写为C-x，在字符串中表示为“\C-x”。你也可以组合CONTROL和META键。CONTROL-META-x简写作C-M-x，字符串表示为“\C-\M-x”。顺便，”\C-\M-x”和”\M-\C-x”(META-CONTROL-x)等价。<br />
</p>

<p>
（CONTROL-x在文档里有时也表示为<sup>x</sup>，那么字符串就表示为”\<sup>x</sup>”。）<br />
</p>

<p>
现在我们知道了如何填写global-set-key的第一个参数：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>global-set-key <span style="color: #E6DB74;">"\M-?"</span> command<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
(另一种书写”\M-?”的方式是”\e?”。字符串“\e”表示escape，而M-x和Esc x等价。)<br />
</p>

<p>
下面我们必须找出command需要填写什么。这个参数应该是我们希望M-?触发的帮助函数的名称，也就是当前C-h所触发的函数。在Lisp中，函数使用符号（symbols）来表示。符号就像其他语言中的函数名或者变量名，虽然Lisp在命名时比大多数语言都允许更宽泛的字符集。例如，合法的符号名包括let*以及up&amp;down-p。<br />
</p>
</div>
</div>
</div>
