html/1.html

<div id="outline-container-org02f463b" class="outline-2">
<h2 id="org02f463b"><span class="section-number-2">5</span> C-h绑定到什么</h2>
<div class="outline-text-2" id="text-5">
<p>
要找到帮助命令的符号，我们可以使用C-h b，这将会触发另一个名为describe-bindings的命令。这是帮助系统众多的命令之一。它会弹出一个列出所有有效键绑定的窗口。查找C-h，我们可以找到这一行：<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp">C-h help-command
</pre>
</div>

<p>
这告诉了我们help-command是指向帮助命令的符号。我们的Lisp示例即将完成了，但是我们不能只是写下<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #AE81FF;">(</span>global-set-key &#8220;\M-?&#8221; help-command<span style="color: #AE81FF;">)</span> <span style="color: #75715E;">; </span><span style="color: #75715E;">&#20960;&#20046;&#23545;&#20102;&#65281;</span>
</pre>
</div>

<p>
这是错误的，因为符号只要出现在Lisp表达式里就会马上被解释执行。如果符号出现在列表的第一个位置时，那么它将作为函数的名称来执行。否则，它作为变量的值就要被展开。但是当我们运行global-set-key时，我们不需要help-command所包含的值，不管那是什么。我们需要的是help-command这个符号的本身。简而言之，我们希望在传递给global-set-key之前不要对符号进行求值。毕竟就我们所知，help-command并没有作为变量的值存在。<br />
</p>

<p>
阻止符号（以及其他任何Lisp表达式）被求值的方法是在它的前面加一个单引号（'）进行引用（quoted）。就像这样：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>global-set-key <span style="color: #E6DB74;">"\M-?"</span> 'help-command<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
我们的Lisp例子现在完成了。如果你把它放到你的.emacs文件中，那么以后当你打开Emacs时M-?将会触发help-command。（马上我们将会学到如何立即触发Lisp表达式。）M-? b将会像C-h b一样触发describe-bindings（这时M-?和C-h都绑定到了help-command）。<br />
</p>

<p>
顺便，为了说明引用和非引用的区别，下面两条表达式可以达成同样的效果：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">setq</span> x 'help-command<span style="color: #AE81FF;">)</span> <span style="color: #75715E;">;  </span><span style="color: #75715E;">setq&#20998;&#37197;&#19968;&#20010;&#21464;&#37327;</span>
<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #E6DB74;">"\M-?"</span> x<span style="color: #AE81FF;">)</span> <span style="color: #75715E;">; </span><span style="color: #75715E;">&#20351;&#29992; x &#30340;&#21464;&#37327;&#20540;</span>
</pre>
</div>

<p>
第一行使变量x保存符号help-command。第二行使用x的值&#x2013;符号help-command&#x2013;绑定给M-?。这个例子与上一个的唯一区别是你现在多使用了一个变量x。<br />
</p>

<p>
符号并不是唯一可以被单引号前缀的；任何Lisp表达式都能被引用，包括列表，数字，字符串，以及其他我们后面将要学到的表达式。'expr是下面的简写：<br />
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">quote</span> expr<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
这在执行的时候会延缓求值（yield）。你可能已经注意到了符号help-command需要引用而字符串参数“\M-?”却不需要。这是因为在Lisp里，字符串是自解释的，当字符串被执行时，它返回的是它本身。所以对其进行引用是无害而多余的。数字，字符以及向量（vector）是其他自解释的Lisp表达式。<br />
</p>
</div>
</div>
<div id="outline-container-orgbb0f5ee" class="outline-2">
<h2 id="orgbb0f5ee"><span class="section-number-2">6</span> C-h应该绑定到什么？</h2>
<div class="outline-text-2" id="text-6">
<p>
既然我们已经将help-command绑定到M-?，下面我们需要给C-h绑定一些什么。使用前面所描述的同样的流程&#x2013;也就是说，触发命令describe-bindings（使用C-h b或者M-? b）&#x2013;我们发现DEL触发的命令是delete-backward-char。<br />
</p>

<p>
所以我们可以这样写：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>global-set-key <span style="color: #E6DB74;">"\C-h"</span> 'delete-backward-char<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
现在DEL和C-h一样了。如果你把下面的命令放到.emacs里：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>global-set-key <span style="color: #E6DB74;">"\M-?"</span> 'help-command<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #E6DB74;">"\C-h"</span> 'delete-backward-char<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
那么以后在Emacs里，BACKSPACE/DELETE/ERASE将会执行正确的事情，不管发出的是BS还是DEL。但是我们如何使他们马上产生效果呢？这需要显式执行（explicit evaluation）这两个表达式。<br />
</p>
</div>
</div>

<div id="outline-container-org86bff57" class="outline-2">
<h2 id="org86bff57"><span class="section-number-2">7</span> 执行Lisp表达式</h2>
<div class="outline-text-2" id="text-7">
<p>
有几种方式来显式执行Lisp表达式。<br />
</p>

<ol class="org-ol">
<li>你可以将Lisp表达式放到一个文件里，然后载入这个文件。假设你把表达式放到文件rebind.el里。（Emacs Lisp文件的后缀名是.el）。你可以键入M-x load-file RET rebind.el RET以使Emacs来执行文件的内容。如果你把这些内容放到了.emacs里，你可以使用同样的方法来载入它。但是在你使用了Emacs一段时间后，你的.emacs将会变得越来越大，它的载入将会变得很慢。因此，你不会希望为了一点点改动就重新载入整个文件。因此我们可以使用下一种选择。<br /></li>

<li><p>
你可以使用命令eval-last-sexp，这绑定到了[<a href="#orgba12bee">4</a>]C-x C-e上。（sexp[<a href="#orgf6e3553">5</a>]是S表达式（S-expression）的简写，也就是符号表达式的简写，也就是Lisp表达式的另一种说法。）这个命令将执行光标左边的Lisp表达式。所以你要做的是将光标放到第一行的末尾：  <br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>global-set-key <span style="color: #E6DB74;">"\M-?"</span> 'help-command<span style="color: #AE81FF;">)</span> |
<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #E6DB74;">"\C-h"</span> 'delete-backward-char<span style="color: #AE81FF;">)</span>
</pre>
</div>
<p>
  然后按下C-x C-e；然后移动到第二行尾：  <br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>global-set-key <span style="color: #E6DB74;">"\M-?"</span> 'help-command<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>global-set-key <span style="color: #E6DB74;">"\C-h"</span> 'delete-backward-char<span style="color: #AE81FF;">)</span> |
</pre>
</div>
<p>
  然后再次按下C-x C-e。执行global-set-key的结果&#x2013;一个特别的符号nil（我们后面将会再次看到）&#x2013;展示在了Emacs屏幕下方的消息区里。<br />
</p></li>

<li><p>
你可以使用命令eval-expression，这绑定到了M-:[<a href="#org355b99f">6</a>]。这个命令在minibuffer（屏幕的底部）中提示你输入一个Lisp表达式，然后执行它并输出结果。Emacs的制作者认为eval-expression是少数一些对于初学者来说尝试使用会造成危险的命令之一。以我来看，这简直是胡说；不论如何，这个命令在初始时是被禁用的，所以当你尝试使用时，Emacs告诉你“You have typed M-:, invoking disabled command eval-expression.”。然后它会显示eval-expression的描述并且如下提示：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">You can now type
Space to try the command just this once,
but leave it disabled,
Y to try it and enable it <span style="color: #AE81FF;">(</span>no questions if you use it again<span style="color: #AE81FF;">)</span>,
N to do nothing <span style="color: #AE81FF;">(</span>command remains disabled<span style="color: #AE81FF;">)</span>.
</pre>
</div>

<p>
  如果你选择Y，Emacs将会把下面的表达式加入你的.emacs。  <br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>put 'eval-expression 'disabled nil<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
（put函数和属性列表(property list)有关，我们将会在第三章的<a href="3.html#MissingReference">符号属性</a>中看到它）我的建议是你可以在获得这个提示之前就把它手动加入到.emacs里，这样你就不会被“disabled command”警告所困扰了。当然，当你把这条语句放到.emacs里之后，使用前面提到的eval-last-sexp使它马上生效是一个不错的想法。<br />
</p></li>

<li>你可以使用*scratch* buffer。这个buffer在Emacs启动的时候就会自动创建。它使用了Lisp 交互模式。在这个模式里，按下C-j来执行eval-print-last-sexp，它很像eval-last-sexp，除了它会将结果插入到光标所在的位置。Lisp交互模式的另一个特性是你可以使用M-TAB进行自动补全（触发lisp-complete-symbol）。Lisp交互模式在用来调试太长的Lisp表达式或者数据结构太复杂的时候特别有用。<br /></li>
</ol>

<p>
不管你使用哪一种方法，执行global-set-key表达式的结果是产生了新的按键绑定。<br />
</p>
</div>
</div>
