1.org
* Apropos
在结束第一个例子之前，让我们讨论一下Emacs的最重要的在线帮助特性，apropos。假设你同时拥有BS和DEL键，你希望BS删除光标前面的字符而DEL删除后面的。你现在知道了delete-backward-char用来完成前面的目的，但是你不知道什么命令完成后面的。你确信Emacs一定有这么一个命令。但是如何找到它呢？

答案是使用apropos命令，它允许你使用表达式来搜索所有已知的变量名和函数名。试试这么做[[[1-7][7]]]：

#+BEGIN_SRC elisp
  M-x apropos RET delete RET
#+END_SRC

返回值是一个列出了所有符合“delete”的变量和函数的buffer。如果我们在这个buffer里搜索“character”，然后翻到这一部分
#+BEGIN_SRC elisp
  backward-delete-char 
  Command: Delete the previous N characters (following if N is negative). 
  backward-delete-char-untabify 
  Command: Delete characters backward, changing tabs into spaces. 
  delete-backward-char 
  Command: Delete the previous N characters (following if N is negative). 
  delete-char 
  Command: Delete the following N characters (previous if N is negative). 
#+END_SRC

而函数delete-char正是我们需要的。

#+BEGIN_SRC emacs-lisp
  (global-set-key "\C-?" 'delete-char)
#+END_SRC

（由于历史原因，DEL由CONTROL-question-mark来触发。）

你可以使用前置参数来执行apropos。在Emacs中，在执行命令前按下C-u将会向命令传递额外的参数。通常，C-u后面跟着一个数字；例如C-u 5 C-b表示“将光标向前移动5个字符”。有时额外的参数就是你按下的C-u本身。

当apropos使用了前置参数时，它不只显示所有符合搜索表达式的函数和变量，它还展示出列表中每个命令绑定的按键（这不是默认的，因为搜索按键绑定很慢）。使用C-u M-x apropos RET delete RET 然后搜索“character”，我们将会得到下面的信息：

#+BEGIN_SRC elisp
  backward-delete-char (not bound to any keys) 
  Command: Delete the previous N characters (following if N is negative). 
  backward-delete-char-untabify (not bound to any keys) 
  Command: Delete characters backward, changing tabs into spaces. 
  delete-backward-char C-h, DEL 
  Command: Delete the previous N characters (following if N is negative). 
  delete-char C-d 
  Command: Delete the following N characters (previous if N is negative). 
#+END_SRC

这证实了现在C-h和DEL都会执行delete-backward-char，并且告诉了我们delete-char已经有了一个绑定：C-d。在我们执行
#+BEGIN_SRC emacs-lisp
  (global-set-key "\C-?" 'delete-char)
#+END_SRC

之后，如果我们再次执行apropos，我们将会得到
#+BEGIN_SRC elisp
  backward-delete-char (not bound to any keys) 
  Command: Delete the previous N characters (following if N is negative). 
  backward-delete-char-untabify (not bound to any keys) 
  Command: Delete characters backward, changing tabs into spaces. 
  delete-backward-char C-h 
  Command: Delete the previous N characters (following if N is negative). 
  delete-char C-d, DEL 
  Command: Delete the following N characters (previous if N is negative). 
#+END_SRC

如果我们知道我们要搜索的对象是Emacs命令，而不是变量或者函数，我们可以使用command-apropos（M-? a）来缩小搜索范围。命令和其他Lisp函数的区别是命令特别用于交互式的触发，也就是说可以通过按键或者M-x触发。非命令的函数只能被其他Lisp代码调用或者被类似eval-epression和eval-last-sexp这样的命令来执行。我们将会在下一章看到更多的函数和命令的知识。

<<1-1>>[1]. 批评者通常认为Lisp的括号是它标志性的缺点。他们认为，Lisp是“Lots of Infernal Stupid Parentheses”的简写（实际上是“List Processing”的简写）。以我来看，这个更简单的符号使得Lisp比其他语言更易读，而我希望你也这么认为。

<<1-2>>[2]. Emacs使用了一种标记-清扫的垃圾回收设计，是最简单的垃圾回收实现方式之一。有一些其他的实现方式会更少打扰用户；例如，一种称为“incremental”的方式在执行时不会使Emacs当机。不幸的是，Emacs没有使用这些方式。

<<1-3>>[3]. 你可以使用length函数查看字符串的长度来确认这件事。如果你执行(length "\M-?")，结果为1。如何“执行”在本章的后面有介绍。

<<1-4>>[4]. 技术上说，我们应该说按键被绑定到了命令上，而不是命令绑定到了按键上。（说按键“绑定到”了命令上正确的表示了这个按键序列只能做一件事--触发这个命令。说命令“绑定”到了一个按键上则表示只有这个按键序列能够触发这个命令，而这并不是真的。）但是一般来说这种误用的“绑定到”并不会引起什么误会。

<<1-5>>[5]. 遗憾地读作“sex pee.”。

<<1-6>>[6]. 这个按键绑定是19.29新引入的。在之前的版本，eval-expression默认绑定到M-ESC。

<<1-7>>[7]. 所有的Emacs命令，不管它们绑定到了哪里（如果有的话），都可以通过M-x command-name RET来执行。自然，M-x自己也是一个绑定到按键上的命令，execute-extend-command，它会提示输入一个要执行的函数名。
